Tekla.Structures.Internal.ITsInvoker
Interface method for Plugin Invoker
To avoid direct reference of Tekla.Technology.Scripting, use this interface for using Invoker functionality
and inject an implementation of ITsInvoker

Tekla.Structures.Internal.ITsInvoker.AppDomainFriendlyName
application domain friendly name

Tekla.Structures.Internal.ITsInvoker.Load(System.String)
Load assembly
assemblyName:  Assembly name
Returns: loaded assembly

Tekla.Structures.Internal.ITsInvoker.LoadFrom(System.String)
Loads assembly from provided file name
assemblyFileName:  Assembly file name
Returns: loaded assembly

Tekla.Structures.Internal.ITsInvoker.CreateInstance(System.String,System.String,System.Object[])
Creates instance of Ivoker
assemblyName: Assembly name
typeName:  assembly type name
parameters: parameters
Returns: invoker object

Tekla.Structures.Internal.ITsInvoker.CreatePermanentInstance(System.String,System.String,System.Object[])
creates permanent instance
assemblyName:  Assembly name
typeName: type name
parameters: parameters
Returns: invoker object

Tekla.Structures.Internal.ITsInvoker.FreePermanentInstance(System.Object)
Frees invoer instance
instance: instance to free

Tekla.Structures.Internal.ITsInvoker.Invoke(System.String,System.String,System.String,System.Object[])
Invokes a method with parameters in the assembly name provided
assemblyName: assembly name
typeName: type name
methodName: method name
parameters: parameters
Returns: invoker object

Tekla.Structures.Internal.ITsInvoker.Invoke(System.Object,System.String,System.Object[])
Invokes a method with parameters in the target provided
target: Target where method needs to be invoked
methodName: method name
parameters: parameters
Returns: invoker object

Tekla.Structures.Internal.ITsInvoker.InvokeMember(System.String,System.String,System.String,System.Reflection.BindingFlags,System.Object[])
Invokes a member with parameters in the assembly provided
assemblyName: assembly name
typeName: type name
memberName: member name
invokeFlags: invoke flags
parameters: parameters
Returns: Invoker object

Tekla.Structures.Internal.ITsInvoker.InvokeMember(System.Object,System.String,System.Reflection.BindingFlags,System.Object[])
Invokes a member with parameters in the target provided
target: target
memberName: member name
invokeFlags: invoke flags
parameters: parameters
Returns: Invoker object

Tekla.Structures.Internal.ITsInvoker.GetTypeNames(System.String)
Get type names in the assembly
assemblyName: assembly name
Returns: type names

Tekla.Structures.Internal.ITsInvoker.GetMethodNames(System.String,System.String)
Get method names in the assembly
assemblyName: assemblly name
typeName: type name
Returns: method names

Tekla.Structures.Internal.ITsInvoker.GetAssemblyLocation(System.String)
Gets assembly location
assemblyName: assembly name
Returns: assembly location

Tekla.Structures.Internal.ITsInvoker.IsSubclass(System.String,System.String,System.String,System.String)
IsSubclass
assemblyName: assembly name
typeName: type name
parentAssemblyName: parent Assembly Name
parentTypeName:  parent Type Name
Returns: IsSubClass or not